In [1]:
import pandas as pd
import numpy as np

In [2]:
transactions = pd.read_csv("./input/sales_train.csv")

In [3]:
transactions['date'] = pd.to_datetime(transactions['date'],format="%d.%m.%Y")

In [4]:
transactions = transactions.assign(year=transactions['date'].dt.year)

In [5]:
transactions = transactions.assign(month=transactions['date'].dt.month)

In [6]:
transactions = transactions.assign(day =transactions['date'].dt.day)

In [7]:
transactions.head(5)

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,year,month,day
0,2013-01-02,0,59,22154,999.00,1.0,2013,1,2
1,2013-01-03,0,25,2552,899.00,1.0,2013,1,3
2,2013-01-05,0,25,2552,899.00,-1.0,2013,1,5
3,2013-01-06,0,25,2554,1709.05,1.0,2013,1,6
4,2013-01-15,0,25,2555,1099.00,1.0,2013,1,15

In [8]:
max_revenue =transactions[(transactions.year==2014)&(transactions.month==9)]

In [9]:
max_revenue['total_sales'] = max_revenue['item_price']*max_revenue['item_cnt_day']

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [10]:
max_revenue.groupby('shop_id').total_sales.sum().max()

7982852.1999999564

In [11]:
day_seq=transactions[(transactions.shop_id==25)&(transactions.year==2014)&(transactions.month==12)]
df_items=day_seq.groupby('day')['item_cnt_day'].agg('sum')
df_items_var=pd.DataFrame(df_items).var(axis=0,ddof=1)

In [12]:
df_items_var

item_cnt_day    117167.702299
dtype: float64

In [13]:
item_cat = pd.read_csv("./input/item_categories.csv")

In [14]:
item_cat.tail(5)

           item_category_name  item_category_id
79                  Служебные                79
80         Служебные - Билеты                80
81    Чистые носители (шпиль)                81
82  Чистые носители (штучные)                82
83           Элементы питания                83

In [15]:
item_cat.head(3)

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2

In [16]:
items = pd.read_csv("./input/items.csv")

In [17]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [18]:
items.tail()

,item_name,item_id,item_category_id
22165,"Ядерный титбит 2 [PC, Цифровая версия]",22165,31
22166,Язык запросов 1С:Предприятия [Цифровая версия],22166,54
22167,Язык запросов 1С:Предприятия 8 (+CD). Хрустале...,22167,49
22168,Яйцо для Little Inu,22168,62
22169,Яйцо дракона (Игра престолов),22169,69

In [19]:
summer = (transactions['date'] >= "2014-06-01") & (transactions['date'] <= "2014-08-31")

In [20]:
summer = transactions.loc[summer]

In [21]:
summer.tail()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,year,month,day
1953686,2014-08-16,19,27,2770,999.0,1.0,2014,8,16
1953687,2014-08-15,19,27,2769,999.0,1.0,2014,8,15
1953688,2014-08-01,19,27,2585,1249.0,1.0,2014,8,1
1953689,2014-08-30,19,27,2578,299.0,1.0,2014,8,30
1953690,2014-08-24,19,27,2578,299.0,1.0,2014,8,24

In [22]:
summer['total_sales'] = summer['item_price']*summer['item_cnt_day']

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [23]:
tm1 = summer.groupby(['item_id'])['total_sales'].sum().argmax()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: 'argmax' is deprecated. Use 'idxmax' instead. The behavior of 'argmax' will be corrected to return the positional maximum in the future. Use 'series.values.argmax' to get the position of the maximum now.
  """Entry point for launching an IPython kernel.

In [25]:
tm1

6675

In [24]:
df_new = pd.DataFrame(transactions.groupby(['item_id'])['item_price'].nunique())
df_new[df_new['item_price']==1]

         item_price
item_id
0                 1
1                 1
2                 1
4                 1
5                 1
6                 1
7                 1
8                 1
9                 1
10                1
11                1
12                1
13                1
14                1
15                1
16                1
17                1
18                1
19                1
20                1
21                1
22                1
23                1
24                1
25                1
26                1
50                1
58                1
68                1
92                1
...             ...
22063             1
22065             1
22077             1
22078             1
22080             1
22081             1
22082             1
22084             1
22085             1
22086             1
22089             1
22093             1
22094             1
22095             1
22096             1
22098             1
22107             1
22109             1
22110             1
22115             1
22138             1
22142             1
22148             1
22156             1
22158             1
22159             1
22161             1
22165             1
22166             1
22169             1

[5926 rows x 1 columns]

In [26]:
transactions['category'] = [ items.item_category_id.iloc[item] for item in transactions['item_id']]

In [29]:
transactions['total_sales'] = transactions['item_price']*transactions['item_cnt_day']

In [46]:
category_id = transactions.groupby(['category'])['total_sales'].sum()

In [65]:
category_id.

category
0     2.634000e+02
1     4.310000e+02
2     4.356447e+07
3     6.255353e+07
4     1.332177e+06
5     6.384949e+06
6     3.822074e+07
7     1.433048e+07
8     1.930989e+07
9     6.538910e+06
10    1.998000e+03
11    8.111738e+07
12    2.922398e+08
13    1.625647e+06
14    2.823560e+07
15    7.188090e+07
16    5.222703e+07
17    6.997925e+05
18    3.828200e+03
19    4.120503e+08
20    3.730103e+08
21    1.890998e+07
22    3.294071e+07
23    2.596191e+08
24    4.081020e+07
25    1.650223e+07
26    1.831980e+04
27    5.422000e+03
28    1.364191e+08
29    6.021982e+07
          ...
54    1.199632e+06
55    1.000226e+08
56    9.499672e+06
57    9.199030e+06
58    2.321675e+07
59    2.825840e+06
60    4.956146e+06
61    2.231643e+07
62    2.873323e+07
63    4.545502e+07
64    4.010668e+07
65    2.472789e+07
66    4.423453e+05
67    3.037514e+07
68    3.322430e+05
69    3.020935e+07
70    1.656192e+07
71    9.342066e+05
72    6.895211e+07
73    2.623669e+07
74    1.998080e+05
75    8.708593e+07
76    7.392474e+06
77    7.925068e+05
78    6.834920e+05
79    1.720083e+07
80    8.360800e+06
81    1.757410e+05
82    3.362661e+05
83    1.189234e+06
Name: total_sales, Length: 84, dtype: float64

In [ ]:
groupby('item_category_id')["revenue"].sum()